<?
if($INCLUDE_FROM_CACHE!='Y')return false;
$datecreate = '001615618159';
$dateexpire = '001615621759';
$ser_content = 'a:2:{s:7:"CONTENT";s:0:"";s:4:"VARS";a:5:{i:0;a:2:{s:2:"ID";s:1:"1";s:4:"NAME";s:28:"Администраторы";}i:1;a:2:{s:2:"ID";s:1:"2";s:4:"NAME";s:87:"Все пользователи (в том числе неавторизованные)";}i:2;a:2:{s:2:"ID";s:1:"3";s:4:"NAME";s:92:"Пользователи, имеющие право голосовать за рейтинг";}i:3;a:2:{s:2:"ID";s:1:"4";s:4:"NAME";s:95:"Пользователи имеющие право голосовать за авторитет";}i:4;a:2:{s:2:"ID";s:1:"5";s:4:"NAME";s:41:"Почтовые пользователи";}}}';
return true;
?>